Hey there! ðŸ‘‹ Welcome to Day 7 of the Python Party! ðŸŽ‰

I'm Dawn, and I'll be your coding companion today. We're going to work on some fun Python challenges using pandas and data analysis.

Let's dive into today's challenge!

You are a Product Analyst working on Nike's marketing performance team. Your team wants to evaluate the effectiveness of celebrity product collaborations by analyzing sales data. You will investigate the performance of celebrity product drops to inform future marketing strategies.

In [2]:
import pandas as pd
import numpy as np

In [3]:
fct_sales = pd.read_csv(r"C:\Users\abarr\Desktop\ironhack\extra\python summer party\day7\sales.csv")
fct_sales.head(10)

   sale_id   sale_date  product_id  sale_amount  celebrity_id
0        1  2025-01-10         901          NaN           101
1        2  2025-01-15         901      1500.00           101
2        3  2025-02-03         902      2000.50           102
3        4  2025-03-12         903      2500.75           103
4        5  2025-03-20         904          NaN           104
5        6  2025-02-28         901      1000.00           101
6        7  2025-03-25         902       300.00           102
7        8  2025-03-30         905      1800.00           105
8        9  2025-01-20         903      1200.00           103
9       10  2025-02-05         906       500.00           106

In [7]:
fct_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sale_id       19 non-null     int64
 1   sale_date     19 non-null     datetime64[ns]
 2   product_id    19 non-null     int64
 3   sale_amount   16 non-null     float64
 4   celebrity_id  19 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 892.0 bytes

In [6]:
fct_sales['sale_date'] = pd.to_datetime(fct_sales['sale_date'], format='%Y-%m-%d')

### 1
For Q1 2025 (January 1st through March 31st, 2025), can you identify all records of celebrity collaborations from the sales data where the sale_amount is missing? This will help us flag incomplete records that could impact the analysis of Nike's product performance.

In [ ]:
q1_sales = fct_sales[(fct_sales['sale_date'] >= '2025-01-01') & (fct_sales['sale_date'] <= '2025-03-31')]
q1_sales.head()

   sale_id  sale_date  product_id  sale_amount  celebrity_id
0        1 2025-01-10         901          NaN           101
1        2 2025-01-15         901      1500.00           101
2        3 2025-02-03         902      2000.50           102
3        4 2025-03-12         903      2500.75           103
4        5 2025-03-20         904          NaN           104

In [13]:
q1_missing_sales = q1_sales[q1_sales['sale_amount'].isna()]
q1_missing_sales

    sale_id  sale_date  product_id  sale_amount  celebrity_id
0         1 2025-01-10         901          NaN           101
4         5 2025-03-20         904          NaN           104
12       13 2025-03-15         909          NaN           102

### 2
For Q1 2025 (January 1st through March 31st, 2025), can you list the unique combinations of celebrity_id and product_id from the sales table? This will ensure that each collaboration is accurately accounted for in the analysis of Nike's marketing performance.

In [ ]:
combinations = q1_sales[['celebrity_id','product_id']].drop_duplicates()

In [24]:
combinations

    celebrity_id  product_id
0            101         901
2            102         902
3            103         903
4            104         904
7            105         905
9            106         906
10           107         907
11           101         908
12           102         909
13           108         910

### 3
For Q1 2025 (January 1st through March 31st, 2025), can you rank the unique celebrity collaborations based on their total sales amounts and list the top 3 collaborations in descending order? This will help recommend the most successful partnerships for Nike's future product drop strategies.

In [35]:
top_sales = q1_sales.groupby('celebrity_id')['sale_amount'].sum().sort_values(ascending=False)

In [36]:
top_sales

celebrity_id
102    3800.50
101    3800.00
103    3700.75
105    2500.00
107    2200.00
108     900.00
106     500.00
104       0.00
Name: sale_amount, dtype: float64

In [33]:
top3 = top_sales.nlargest(3)

In [34]:
top3

celebrity_id
102    3800.50
101    3800.00
103    3700.75
Name: sale_amount, dtype: float64